In [1]:
import pandas as pd
import os
import matplotlib.pyplot as plt

In [11]:
ml = pd.read_parquet(r'D:\daneshkar\pandas-numpy-matplotlib\x\final_datasets\raw_match\away_team_all_days.parquet')
ml

,match_id,name,slug,gender,user_count,residence,birthplace,height,weight,plays,...,period_2,period_3,period_4,period_5,period_1_tie_break,period_2_tie_break,period_3_tie_break,period_4_tie_break,period_5_tie_break,normal_time
0,11998445,Auger-Aliassime F.,auger-aliassime-felix,M,23318.0,"Monte Carlo, Monaco","Montreal, Canada",1.93,87.0,right-handed,...,NaN,NaN,None,None,NaN,NaN,NaN,None,None,None
1,11998446,Cobolli F.,flavio-cobolli,M,5995.0,Rome,"Florence, Italy",1.83,71.0,right-handed,...,NaN,NaN,None,None,NaN,NaN,NaN,None,None,None
2,11998447,Martínez P.,martinez-pedro,M,2621.0,"Valencia, Spain","Alzira, Spain",1.85,76.0,right-handed,...,NaN,NaN,None,None,NaN,NaN,NaN,None,None,None
3,11998448,Muller A.,muller-alexandre,M,2443.0,France,"Poissy, France",1.83,73.0,right-handed,...,NaN,NaN,None,None,NaN,NaN,NaN,None,None,None
4,11998449,Mayot H.,mayot-harold,M,1492.0,"Marly, France","Metz, France",1.78,78.0,right-handed,...,NaN,NaN,None,None,NaN,NaN,NaN,None,None,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
59251,12213482,None,None,None,NaN,None,None,NaN,NaN,None,...,4.0,NaN,None,None,NaN,NaN,NaN,None,None,None
59252,12213483,None,None,None,NaN,None,None,NaN,NaN,None,...,4.0,NaN,None,None,NaN,NaN,NaN,None,None,None
59253,12213484,None,None,None,NaN,None,None,NaN,NaN,None,...,3.0,NaN,None,None,NaN,NaN,NaN,None,None,None
59254,12213486,None,None,None,NaN,None,None,NaN,NaN,None,...,4.0,NaN,None,None,NaN,NaN,NaN,None,None,None
59255,12213803,None,None,None,NaN,None,None,NaN,NaN,None,...,1.0,NaN,None,None,NaN,NaN,NaN,None,None,None

In [12]:
hl = pd.read_parquet(r'D:\daneshkar\pandas-numpy-matplotlib\x\final_datasets\raw_match\home_team_all_days.parquet')
hl

,match_id,name,slug,gender,user_count,residence,birthplace,height,weight,plays,...,period_2,period_3,period_4,period_5,period_1_tie_break,period_2_tie_break,period_3_tie_break,period_4_tie_break,period_5_tie_break,normal_time
0,11998445,Cazaux A.,cazaux-arthur,M,4481.0,None,"Montpellier, France",1.83,NaN,right-handed,...,NaN,NaN,None,None,NaN,NaN,NaN,None,None,None
1,11998446,Lestienne C.,lestienne-constant,M,2032.0,"Paris, France","Amiens, France",1.80,72.0,right-handed,...,NaN,NaN,None,None,NaN,NaN,NaN,None,None,None
2,11998447,Ćorić B.,coric-borna,M,12414.0,"Dubai, UAE","Zagreb, Croatia",1.88,85.0,right-handed,...,NaN,NaN,None,None,NaN,NaN,NaN,None,None,None
3,11998448,Mmoh M.,mmoh-michael,M,2206.0,"Bradenton, FL, USA","Riyadh, Saudi Arabia",1.88,90.0,right-handed,...,NaN,NaN,None,None,NaN,NaN,NaN,None,None,None
4,11998449,Paire B.,paire-benoit,M,6089.0,"Geneva, Switzerland","Avignon, France",1.96,80.0,right-handed,...,NaN,NaN,None,None,NaN,NaN,NaN,None,None,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
60769,12213482,None,None,None,NaN,None,None,NaN,NaN,None,...,6.0,NaN,None,None,NaN,NaN,NaN,None,None,None
60770,12213483,None,None,None,NaN,None,None,NaN,NaN,None,...,6.0,NaN,None,None,NaN,NaN,NaN,None,None,None
60771,12213484,None,None,None,NaN,None,None,NaN,NaN,None,...,6.0,NaN,None,None,NaN,NaN,NaN,None,None,None
60772,12213486,None,None,None,NaN,None,None,NaN,NaN,None,...,6.0,NaN,None,None,NaN,NaN,NaN,None,None,None
60773,12213803,None,None,None,NaN,None,None,NaN,NaN,None,...,6.0,NaN,None,None,NaN,NaN,NaN,None,None,None

In [13]:
hf = hl[['full_name' , 'current_rank' , 'height']]
hf

                 full_name  current_rank  height
0           Cazaux, Arthur          86.0    1.83
1      Lestienne, Constant          99.0    1.80
2             Ćorić, Borna          31.0    1.88
3            Mmoh, Michael         122.0    1.88
4            Paire, Benoit         110.0    1.96
...                    ...           ...     ...
60769                 None           NaN     NaN
60770                 None           NaN     NaN
60771                 None           NaN     NaN
60772                 None           NaN     NaN
60773                 None           NaN     NaN

[60774 rows x 3 columns]

In [14]:
hr = hf.dropna()
hr

                               full_name  current_rank  height
0                         Cazaux, Arthur          86.0    1.83
1                    Lestienne, Constant          99.0    1.80
2                           Ćorić, Borna          31.0    1.88
3                          Mmoh, Michael         122.0    1.88
4                          Paire, Benoit         110.0    1.96
...                                  ...           ...     ...
60014  Alvarado Berrospi, Alberto Odiseo        1303.0    1.88
60015                      Damas, Miguel         470.0    2.08
60017                    Forejtek, Jonas         375.0    1.83
60019                       Zhu, Michael         858.0    1.75
60020                    Ojakaar, Oliver         882.0    1.91

[14288 rows x 3 columns]

In [15]:
df = ml[['full_name' , 'current_rank' , 'height' ]  ] 
df

                    full_name  current_rank  height
0      Auger-Aliassime, Felix          30.0    1.93
1              Flavio Cobolli          69.0    1.83
2             Martinez, Pedro         101.0    1.85
3           Muller, Alexandre          81.0    1.83
4               Mayot, Harold         132.0    1.78
...                       ...           ...     ...
59251                    None           NaN     NaN
59252                    None           NaN     NaN
59253                    None           NaN     NaN
59254                    None           NaN     NaN
59255                    None           NaN     NaN

[59256 rows x 3 columns]

In [16]:
rf = df.copy()

In [17]:
kf = rf.dropna()
kf

                    full_name  current_rank  height
0      Auger-Aliassime, Felix          30.0    1.93
1              Flavio Cobolli          69.0    1.83
2             Martinez, Pedro         101.0    1.85
3           Muller, Alexandre          81.0    1.83
4               Mayot, Harold         132.0    1.78
...                       ...           ...     ...
58497          Ribero, Franco        1087.0    1.88
58499       Simonit, Ezequiel        1071.0    1.75
58500          Doria, Luciano        1442.0    1.80
58501  Soriano Barrera, Adria         465.0    1.91
58502        Taberner, Carlos         358.0    1.83

[13499 rows x 3 columns]

In [21]:
merge_total = pd.concat([kf , hr])
merge_total

                               full_name  current_rank  height
0                 Auger-Aliassime, Felix          30.0    1.93
1                         Flavio Cobolli          69.0    1.83
2                        Martinez, Pedro         101.0    1.85
3                      Muller, Alexandre          81.0    1.83
4                          Mayot, Harold         132.0    1.78
...                                  ...           ...     ...
60014  Alvarado Berrospi, Alberto Odiseo        1303.0    1.88
60015                      Damas, Miguel         470.0    2.08
60017                    Forejtek, Jonas         375.0    1.83
60019                       Zhu, Michael         858.0    1.75
60020                    Ojakaar, Oliver         882.0    1.91

[27787 rows x 3 columns]

In [22]:
sorted = merge_total.sort_values('current_rank' , ascending= True)
sorted

              full_name  current_rank  height
20579      Swiatek, Iga           1.0    1.76
20581      Swiatek, Iga           1.0    1.76
35629      Swiatek, Iga           1.0    1.76
12641      Swiatek, Iga           1.0    1.76
44699      Swiatek, Iga           1.0    1.76
...                 ...           ...     ...
14275  Rousseau, Hillel        1858.0    1.80
39066   Rocens, Martins        1858.0    1.85
2174    Rocens, Martins        1858.0    1.85
39295   Rocens, Martins        1858.0    1.85
42658   Rocens, Martins        1858.0    1.85

[27787 rows x 3 columns]

پیدا کردن ارتباط بین قد و رتبه ( عددی بین -۱ تا ۱ )

In [23]:
correlation = sorted['height'].corr(sorted['current_rank'])
print('correlation is : ' , correlation)

correlation is :  0.07834513388031811